###############################################################################
# Created by write_sdc
###############################################################################
current_design mk_fp32_cfloat152
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 15.0000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.2500 CLK
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RST_N}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {bias_in_bias[5]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[10]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[11]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[12]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[13]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[14]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[15]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[16]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[17]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[18]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[19]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[20]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[21]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[22]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[23]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[24]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[25]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[26]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[27]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[28]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[29]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[30]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[31]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[5]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[6]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[7]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[8]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {fp32_in_fp_in[9]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[4]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[5]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[6]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {cfloat152_out[7]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {cfloat152_out[7]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[6]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[5]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[4]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[3]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[2]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[1]}]
set_load -pin_load 0.0334 [get_ports {cfloat152_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RST_N}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {bias_in_bias[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fp32_in_fp_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 6.0000 [current_design]
